Repository: 84000/data-translation-memory
Catalog: toh238-v3.tmx
Source language: bo
Languages: en

source: ཆོས་ཐམས་ཅད་ནི་སྨོན་པ་མ་མཆིས་པས་དུལ་བ་སྟེ། དེ་ལ་ཡིད་ཀྱིས་སྨོན་པ་དང་། སྨོན་ལམ་ཐམས་ཅད་མི་སྤྱོད་དོ། །
en: All phenomena are tamed through wishlessness; they are not involved with hope or aspiration.

source: ཆོས་ཐམས་ཅད་ནི་བདག་མ་མཆིས་པས་དུལ་བ་སྟེ། དེ་ལ་ཆགས་པ་ཐམས་ཅད་མི་སྤྱོད་དོ། །
en: All phenomena are tamed through selflessness; they are not involved with attachment.

source: ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་མ་མཆིས་པས་དུལ་བ་སྟེ། དེ་ལ་སེམས་ཅན་ཐ་དད་པ་མི་སྤྱོད་དོ། །
en: “All phenomena are tamed though the lack of ‘being’; they are not involved with differences among beings.

source: ཆོས་ཐམས་ཅད་ནི་སྲོག་མ་མཆིས་པས་དུལ་བ་སྟེ། དེ་ལ་འཆི་འཕོ་དང་། སྐྱེ་བ་མི་འཇུག་གོ། །
en: All phenomena are tamed through the lack of lifeforce; they are not subject to passing away or being born.

source: ཆོས་ཐམས་ཅད་ནི་བདེན་པས་དུལ་བ་སྟེ། དེ་ལ་སླུ་བ་ཐམས་ཅད་མི་འཇུག་གོ། །
en: All phenomena are tamed through truth; they are not subject to anything deceptive.

source: ཆོས་ཐམས་ཅད་ནི་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བས་དུལ་བ་སྟེ། དེ་ལ་བདག་པོ་མི་འཇུག་གོ། །
en: All phenomena are tamed through dependent arising; they are not subject to ownership.

source: ཆོས་ཐམས་ཅད་ནི་དྲན་པ་ཉེ་བར་གཞག་པས་དུལ་བ་སྟེ། དེ་ལ་དྲན་པ་དང་ཡིད་ལ་བགྱིད་པ་མི་འཇུག་གོ། །
en: All phenomena are tamed through the recollections of mindfulness; they are not subject to memory or mental engagement.

source: ཆོས་ཐམས་ཅད་ནི་ཡང་དག་པའི་སྤོང་བས་དུལ་བ་སྟེ། དེ་ལ་བླང་བ་དང་དོར་བ་མི་འཇུག་གོ། །
en: All phenomena are tamed through correct relinquishment; they are not subject to acceptance and rejection.

source: ཆོས་ཐམས་ཅད་ནི་རྫུ་འཕྲུལ་གྱི་རྐང་པས་དུལ་བ་སྟེ། དེ་ལ་འོང་བ་དང་འགྲོ་བ་མི་འཇུག་གོ། །
en: All phenomena are tamed through the bases of miraculous power; they are not subject to coming and going.

source: ཆོས་ཐམས་ཅད་ནི་དབང་པོས་དུལ་བ་སྟེ། དེ་ལ་དམན་པ་མི་འཇུག་གོ། །
en: All phenomena are tamed through mastery; they are not subject to being inferior.

source: ཆོས་ཐམས་ཅད་ནི་སྟོབས་ཀྱིས་དུལ་བ་སྟེ། དེ་ལ་འཇོམས་པ་མི་འཇུག་གོ། །
en: All phenomena are tamed through strength; they are not subject to defeat.

source: ཆོས་ཐམས་ཅད་ནི་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གིས་དུལ་བ་སྟེ། དེ་ལ་མི་ཤེས་པ་མི་འཇུག་གོ། །
en: All phenomena are tamed through the branches of awakening; they are not subject to a lack of knowledge.

source: ཆོས་ཐམས་ཅད་ནི་ལམ་གྱིས་དུལ་བ་སྟེ། དེ་ལ་བྱ་བ་ངན་པ་དང་། སེམས་པ་ངན་པ་མི་འཇུག་གོ། །
en: All phenomena are tamed through the path; they are not subject to negative actions or negative thoughts.

source: ཆོས་ཐམས་ཅད་ནི་སྟོབས་བཅུས་དུལ་བ་སྟེ། དེ་ལ་བག་ཆགས་ཐམས་ཅད་མི་འཇུག་གོ། །
en: All phenomena are tamed through the ten strengths; they are not subject to habitual patterns.

source: ཆོས་ཐམས་ཅད་ནི་མི་འཇིགས་པས་དུལ་བ་སྟེ། དེ་ལ་འཇིགས་པ་དང་སྐྲག་པ་ཐམས་ཅད་མ་མཆིས་སོ། །
en: All phenomena are tamed through fearlessness; they are not subject to fear or fright.

source: ཆོས་ཐམས་ཅད་ནི་མ་འདྲེས་པས་དུལ་བ་སྟེ། དེ་ལ་རྩོལ་བ་ཐམས་ཅད་མི་འཇུག་གོ། །
en: All phenomena are tamed through being complete; they are not subject to any kind of effort.

source: ཆོས་ཐམས་ཅད་ནི་ཡེ་ཤེས་ཀྱིས་དུལ་བ་སྟེ། དེ་ལ་མ་རིག་པ་མི་འཇུག་གོ། །
en: “All phenomena are tamed through wisdom; they are not subject to ignorance.

source: ཆོས་ཐམས་ཅད་ནི་བྱེད་པ་པོ་མ་མཆིས་པས་དུལ་བ་སྟེ། དེ་ལ་འདུ་བྱེད་མི་འཇུག་གོ། །
en: All phenomena are tamed through the lack of a creator; they are not subject to formation.

source: ཆོས་ཐམས་ཅད་ནི་དམིགས་པ་མ་མཆིས་པས་དེ་ལ་རྣམ་པར་ཤེས་པ་མི་འཇུག་གོ། །
en: Because all phenomena are not conceptually apprehended, they are not subject to consciousness.

source: ཆོས་ཐམས་ཅད་ནི་སེམས་པ་མ་མཆིས་པས་དེ་ལ་མིང་དང་གཟུགས་མི་འཇུག་གོ། །
en: Because all phenomena lack mind, they are not subject to name and form.

source: ཆོས་ཐམས་ཅད་གནས་མ་མཆིས་པས་དེ་ལ་སྐྱེ་མཆེད་དྲུག་མི་འཇུག་གོ། །
en: Because all phenomena have no basis, they are not subject to the six sense bases.

source: ཆོས་ཐམས་ཅད་ནི་མི་གཉིས་པས་དེ་ལ་རེག་པ་མི་འཇུག་གོ། །
en: Because all phenomena are nondual, they are not subject to contact.

source: ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་རེག་པ་མ་མཆིས་པས་དེ་ལ་ཚོར་བ་མི་འཇུག་གོ། །
en: Because all phenomena lack cognition, they are not subject to sensation.

source: ཆོས་ཐམས་ཅད་ནི་ངའི་མ་མཆིས་པས་དེ་ལ་སྲེད་པ་མི་འཇུག་གོ། །
en: Because all phenomena lack a sense of ‘I,’ they are not subject to craving.

source: ཆོས་ཐམས་ཅད་ནི་མཐུ་རྩལ་མ་མཆིས་པས་དེ་ལ་ལེན་པ་མི་འཇུག་གོ། །
en: Because all phenomena lack active capacity, they are not subject to grasping.

source: ཆོས་ཐམས་ཅད་ནི་ལུས་མ་མཆིས་པས་དེ་ལ་སྲིད་པ་མི་འཇུག་གོ། །
en: Because all phenomena lack physical embodiment, they are not subject to becoming.

source: ཆོས་ཐམས་ཅད་ནི་འཆི་འཕོ་མ་མཆིས་པས་དེ་ལ་སྐྱེ་བ་མི་འཇུག་གོ། །
en: Because all phenomena do not die, they are not subject to birth.

source: ཆོས་ཐམས་ཅད་ནི་སྙིང་པོ་ཅན་ལགས་པས་དེ་ལ་རྒ་བ་མི་འཇུག་གོ། །
en: Because all phenomena have a core essence, they are not subject to old age.

source: ཆོས་ཐམས་ཅད་ནི་མི་ཟད་པས་དེ་ལ་འཆི་བ་མི་འཇུག་སྟེ།
en: Because all phenomena are inexhaustible, they are not subject to death.

source: བཅོམ་ལྡན་འདས་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒྲིབ་པ་མ་མཆིས་པའི་ལམ་ལགས་སོ། །
en: “Blessed One, this is the unobscured path of bodhisattvas.

source: ལམ་འདི་ལ་རྣམ་པར་གནས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བདུད་ཐམས་ཅད་ཀྱིས་མི་འཕྲོགས་པ་ལགས་སོ། །ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་མི་ཐུལ་བ་ལགས་སོ། །ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱིས་མི་རྫི་བ་ལགས་སོ། །
en: Bodhisattvas who follow this path cannot be assailed by any māra, chastened by any opponent, or affected by any afflictive emotion.

source: སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་བསྔགས་པ་ལགས་སོ། །ལྷ་ཐམས་ཅད་ཀྱིས་ཕྱག་བགྱི་བ་ལགས་སོ། །
en: They are praised by all the buddhas and revered by all the gods.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡེ་ཤེས་དེ་ལྟ་བུ་དང་ལྡན་པ་ནི་ཆོས་ཀྱི་གཏེར་ཆེན་པོ་རྙེད་པ་ཞེས་བགྱིའོ། །
en: Blessed One, bodhisattva great beings who are equipped with such wisdom are said to have discovered a great treasury of the Dharma.

source: མི་དབུལ་བ་ཞེས་བགྱིའོ། །
en: They are said to not want for anything.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཐུགས་བརྟན་པ་ཞེས་བགྱིའོ། །
en: They are said to be steadfast in the eyes of the thus-gone ones.

source: དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་མཛོད་འཛིན་པ་ཞེས་བགྱིའོ། །
en: They are said to bear the treasure of all the thus-gone ones.

source: བྱ་བ་བྱས་པ་དང་། བྱེད་པ་བྱས་པ་དང་། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ་ཞེས་བགྱིའོ། །
en: They are said to have completed their work, accomplished their tasks, and fulfilled their aims.

source: རྒྱ་མཚོ་ལྟར་གཏིང་ཚོད་ཡས་པ་དང་། རི་རབ་ལྟར་མི་གཡོ་བ་ཞེས་བགྱིའོ། །
en: They are said to be as vast as the ocean and as unwavering as Mount Sumeru.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཉེ་བར་འཁོར་ཁྱོད་ཀྱི་འདི་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་འཐུན་ཏེ།
en: The Blessed One replied, “Upāli, your Dharma discourse is in accord.

source: ཆོས་ཡང་དག་པར་བརྗོད་པ་འདི་ལ་བརྟེན་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །
en: A bodhisattva great being can attain perfect awakening by relying on this Dharma discourse.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཆོས་ཀྱི་གཙོ་བོ་ལགས་སོ། །
en: The venerable Ānanda next addressed the Blessed One: “Blessed One, upholding the sublime Dharma is the main duty of bodhisattvas.

source: དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལ་བརྩོན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་མཉེས་པར་བགྱིད་པའོ། །
en: A bodhisattva who strives to uphold the sublime Dharma is a bodhisattva who pleases the buddhas.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་ཆོས་བླ་མར་གྱུར་པའོ། །
en: For the buddhas, the Dharma is paramount.

source: བཅོམ་ལྡན་འདས་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: Blessed One, what does it mean to uphold the sublime Dharma?

source: དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་མདོ་སྡེ་ཟབ་པ་རྣམས་ལུང་ནོད་པ་དང་། ཁ་ཏོན་བགྱིད་པ་དང་། དོན་དང་ཚིག་སེམས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Bodhisattvas uphold the sublime Dharma by giving instructions on, chanting, and reflecting on the words and meaning of the profound sūtras spoken by the thus-gone ones.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་སྒྲུབ་པ་ཡོངས་སུ་འཛིན་པ་ནི་བྱང་ཆུབ་སེམས་དཔའི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Blessed One, bodhisattvas also uphold the sublime Dharma by upholding its practice.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྒྲུབ་པ་གང་ཞེ་ན།
en: What do bodhisattvas practice?

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལུས་ཀྱི་ལས་གང་ཅི་ཡང་རུང་། ངག་གི་ལས་གང་ཅི་ཡང་རུང་། ཡིད་ཀྱི་ལས་གང་ཅི་ཡང་རུང་སྟེ། དེ་ཐམས་ཅད་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་ལྟ་བས་འཇུག་གོ། །
en: Blessed One, bodhisattvas engage in any action of body, speech, and mind while being attentive to all beings.

source: སྙིང་རྗེ་ཆེན་པོ་སྔོན་དུ་འགྲོའོ། །སྙིང་རྗེ་ཆེན་པོ་ཆེན་པོའི་དབང་དུ་གྱུར་པའོ། །
en: These actions are based in great compassion and are governed by great compassion.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པའི་གནས་ཀྱི་རྒྱུའོ། །སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་ལྷག་པའི་བསམ་པ་ལས་བྱུང་ངོ་། །
en: This is the basis for establishing the benefit of beings, and proceeds from the highest intention to bring happiness and benefit to all beings.

source: དེ་ལ་ཕན་པའི་བསམ་པ་འདི་ལྟ་བུས་འདུ་ཤེས་འདི་ལྟར་འགྱུར་ཏེ། གང་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་སྒྲུབ་པ་དང་། བདེ་བ་སྒྲུབ་པའི་སྒྲུབ་པ་དེ་བདག་གིས་བསྒྲུབ་བོ་སྙམ་མོ། །
en: With this kind of intention to be of benefit, bodhisattvas adopt the perspective, ‘I will practice those practices that bring benefit and happiness to all beings.’

source: དེ་ཕུང་པོ་རྣམས་ལ་སྒྱུ་མ་ལྟ་བུར་སོ་སོར་རྟོག་པ་སྒྲུབ་ཀྱང་ཕུང་པོ་ཡོངས་སུ་དོར་བར་ཡང་མི་འཚལ་ལོ། །
en: They practice with the awareness that the aggregates are illusory, but do not try to reject the aggregates.

source: ཁམས་རྣམས་ལ་སྦྲུལ་གདུག་པ་ལྟ་བུར་ས་སོར་རྟོག་པ་སྒྲུབ་ཀྱང་། ཁམས་ཡོངས་སུ་དོར་བར་ཡང་མི་འཚལ་ལོ།
en: They practice with the awareness that the elements are like a venomous snake, but do not try to reject the elements.

source: སྐྱེ་མཆེད་རྣམས་ལ་གྲོང་སྟོང་ལྟ་བུར་སོ་སོར་རྟོག་པ་སྒྲུབ་ཀྱང་སྐྱེ་མཆེད་ཡོངས་སུ་དོར་བར་ཡང་མི་འཚལ་ལོ། །
en: They practice with the awareness that the sense bases are like an empty town, but do not try to reject the sense bases.

source: དེ་བཞིན་དུ་གཟུགས་ལ་དབུ་བ་རྡོས་པ་ལྟ་བུར་སོ་སོར་རྟོག་པ་སྒྲུབ་ཀྱང་དེ་བཞིན་གཤེགས་པའི་གཟུགས་ཀྱི་སྐུ་རྣམ་པར་སྒྲུབ་པ་ཡང་མི་འདོར་རོ། །
en: “Similarly, they practice with the awareness that forms are like drifts of foam, but do not reject accomplishing the form body of the thus-gone ones.

source: ཚོར་བ་ལ་ཆུའི་ཆུ་བུར་ལྟ་བུར་སོ་སོར་རྟོག་པ་སྒྲུབ་ཀྱང་དེ་བཞིན་གཤེགས་པའི་བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པའི་བདེ་བ་སྒྲུབ་པའི་སྦྱོར་བ་ལ་མི་རྩོམ་པ་ཡང་མ་ལགས་སོ། །
en: They practice with the awareness that sensations are like bubbles, but do not cease making effort in the methods of practicing the bliss of the Thus-Gone One’s meditative concentration, samādhi, and meditative composure.

source: འདུ་ཤེས་ལ་སྨིག་རྒྱུ་ལྟ་བུར་སོ་སོར་རྟོག་པ་སྒྲུབ་ཀྱང་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྒྲུབ་པ་མི་སྒྲུབ་པ་ཡང་མ་ལགས་སོ། །
en: They practice with the awareness that perceptions are like a mirage, but do not cease to practice the Thus-Gone One’s wisdom.

source: འདུ་བྱེད་རྣམས་ལ་ཆུ་ཤིང་ལྟ་བུར་སོ་སོར་རྟོག་པ་སྒྲུབ་ཀྱང་། སངས་རྒྱས་ཀྱི་ཆོས་མངོན་པར་འདུ་བྱ་བ་མི་སྒྲུབ་པ་ཡང་མ་ལགས་སོ། །
en: They practice with the awareness that karmic formations are like a plantain tree, but do not cease to practice the cultivation of the Buddha’s Dharma.

source: རྣམ་པར་ཤེས་པ་ལ་སྒྱུ་མ་ལྟ་བུར་སོ་སོར་རྟོག་པ་སྒྲུབ་ཀྱང་ཡེ་ཤེས་སྔོན་དུ་འགྲོ་བའི་ལུས་དང་། ངག་དང་། ཡིད་ཀྱི་ལས་སྒྲུབ་པ་མི་སྒྲུབ་པ་ཡང་མ་ལགས་སོ། །
en: They practice with the awareness that consciousness is illusory, but do not cease to practice the actions of body, speech, and mind that are based in wisdom.

source: སྦྱིན་པས་རྣམ་པར་སྨིན་པ་ལ་མི་རེ་བ་སྒྲུབ་བོ། །
en: “Through generosity, bodhisattvas practice not hoping for reward.

source: ཚུལ་ཁྲིམས་ཀྱིས་སེམས་ཅན་ཚུལ་ཁྲིམས་འཆལ་པ་ཡོངས་སུ་སྐྱོབ་པ་སྒྲུབ་བོ། །
en: Through discipline, they practice protecting beings with poor discipline.

source: བཟོད་པས་དུལ་བ་དང་ཞི་བ་སྒྲུབ་བོ། །
en: Through patience, they practice restraint and calm.

source: བརྩོན་འགྲུས་ཀྱིས་དགེ་བའི་ཆོས་སྒྲུབ་པ་ཐམས་ཅད་སྒྲུབ་བོ། །
en: Through diligence they practice every practice of the virtuous Dharma.

source: བསམ་གཏན་རྣམས་ཀྱིས་ལུས་དང་སེམས་ཡོངས་སུ་ལས་སུ་རུང་བ་སྒྲུབ་བོ། །
en: Through meditative stability, they practice every suitable action of body and mind.

source: ཤེས་རབ་ཀྱིས་ཆོས་ཐམས་ཅད་སྣང་བ་སྒྲུབ་བོ། །
en: Through insight, they practice the illumination of all phenomena.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱིས་རྣམ་པར་གཞག་པ་སྒྲུབ་བོ། །
en: “Through the applications of mindfulness, bodhisattvas practice steadiness.

source: ཡང་དག་པར་སྤོང་བ་རྣམས་ཀྱིས་ལུས་དང་སེམས་དྲི་མ་མེད་པ་སྒྲུབ་བོ། །
en: Through the correct abandonments, they practice stainlessness in body and mind.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་ཀྱིས་ཆགས་པ་མེད་པའི་ཡེ་ཤེས་སྒྲུབ་བོ། །
en: Through the bases of miraculous power, they practice the wisdom that is free of attachment.

source: དབང་པོ་རྣམས་ཀྱིས་ཐེག་པའི་མཆོག་སྒྲུབ་བོ། །
en: Through the powers, they practice the supreme vehicle.

source: སྟོབས་རྣམས་ཀྱིས་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སྒྲུབ་བོ། །
en: Through the ten strengths, they practice the irreversibility of a bodhisattva.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཀྱིས་ཐེ་ཙོམ་མེད་པ་སྒྲུབ་བོ། །
en: Through the branches of awakening, they practice being free of doubt.

source: ལམ་གྱིས་ཁ་ན་མ་ཐོ་བ་མེད་པ་སྒྲུབ་བོ། །
en: Through the path, they practice being irreproachable.

source: ཚངས་པའི་གནས་པ་རྣམས་ཀྱིས་དྲང་པོ་སྒྲུབ་བོ། །
en: Through the brahmā states, they practice being righteous.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་གང་སྟོང་པ་ཉིད་སྒོམ་པ་དེ་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: “Furthermore, Blessed One, bodhisattvas who cultivate emptiness uphold the sublime Dharma.

source: དེ་ལ་སྟོང་པ་ཉིད་ནི་སྤྲོས་པ་མ་མཆིས་པའོ། །
en: For them, emptiness is not conceptual.

source: བཅོམ་ལྡན་འདས་སྤྲོས་པ་ལ་དགའ་བ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལ་དགའ་བ་མ་ལགས་སོ། །
en: Blessed One, those who take joy in conceptuality do not take joy in upholding the sublime Dharma.

source: སྟོང་པ་ཉིད་ནི་མཚན་མ་མ་མཆིས་པའོ། །
en: Emptiness is signless.

source: བཅོམ་ལྡན་འདས་མཚན་མ་མ་མཆིས་པ་ལ་སྤྱོད་པ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་ཏེ། མཚན་མ་ལ་སྤྱོད་པ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་མ་ལགས་སོ། །
en: Blessed One, those who involve themselves in signlessness uphold the sublime Dharma, while those who involve themselves with signs do not uphold the sublime Dharma.

source: སྟོང་པ་ཉིད་ནི་སྨོན་ལམ་ཡང་དག་པར་ཆད་པའོ། །
en: Emptiness puts an end to wishes.

source: བཅོམ་ལྡན་འདས་སྨོན་པ་མ་མཆིས་པ་ལ་སྤྱོད་པ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་ཏེ། སྨོན་ལམ་ལ་གནས་པ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་མ་ལགས་སོ། །
en: Blessed One, those who are involved with wishlessness uphold the sublime Dharma, while those who maintain aspirations do not uphold the sublime Dharma.

source: བཅོམ་ལྡན་འདས་དམིགས་པ་ཅན་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་མ་ལགས་སོ། །
en: “Blessed One, those who have conceptual fixation do not uphold the sublime Dharma.

source: ངར་འཛིན་པ་དང་། ང་ཡིར་འཛིན་པ་ལ་གནས་པ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་མ་ལགས་སོ། །
en: Those who grasp at ‘I’ and ‘mine’ do not uphold the sublime Dharma.

source: མངོན་པའི་ང་རྒྱལ་ཅན་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་མ་ལགས་སོ། །
en: Those who have strong pride do not uphold the sublime Dharma.

source: རྙེད་པ་དང་བཀུར་སྟི་དང་། ཚིགས་སུ་བཅད་པ་ལ་གནས་པ་ལ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་མ་ལགས་སོ། །
en: Those who are interested in gain, respect, and fame do not uphold the sublime Dharma.

source: ཕྲག་དོག་དང་། སེར་སྣ་ལ་གནས་པ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་མ་ལགས་སོ། །
en: Those who are jealous and stingy do not uphold the sublime Dharma.

source: འདོད་པ་དང་གནོད་སེམས་དང་རྣམ་པར་འཚེ་བ་མེད་པ་ནི་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་མ་ལགས་སོ། །
en: Those who have abundant desire, maliciousness, and violent tendencies do not uphold the sublime Dharma.

source: བཅོམ་ལྡན་འདས་གང་དག་སེམས་ཅན་རྣམས་ལ་ཐ་དད་པའི་འདུ་ཤེས་མ་མཆིས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: “Blessed One, those bodhisattvas who do not perceive differences among beings uphold the sublime Dharma.

source: བཅོམ་ལྡན་འདས་གང་དག་ཆོས་རྣམས་སྐྱེ་བ་མ་མཆིས་པ་དང་། འགག་པ་མ་མཆིས་པར་མཐོང་བ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Blessed One, those who recognize that phenomena do not arise or cease uphold the sublime Dharma.

source: བཅོམ་ལྡན་འདས་གང་དག་སེམས་ཅན་རྣམས་འོང་བ་མ་མཆིས་པ་དང་། འགྲོ་བ་མ་མཆིས་པར་མཐོང་བ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Blessed One, those who recognize that beings neither come nor go uphold the sublime Dharma.

source: བཅོམ་ལྡན་འདས་གང་དག་བདག་ཀུན་ནས་ཉོན་མོངས་པ་ཡང་མ་ལགས། རྣམ་པར་བྱང་བ་ཡང་མ་ལགས་པར་མཐོང་བ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Blessed One, those who recognize that the self is neither defiled nor pure uphold the sublime Dharma.

source: གང་དག་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ལ་རྗེས་སུ་ཆགས་པ་ཡང་མ་མཆིས། མུ་སྟེགས་ཅན་གྱི་ཆོས་རྣམས་ལ་ཁོང་ཁྲོ་བ་ཡང་མ་མཆིས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who are neither attached to the Dharma teachings of the buddhas nor hostile to the teachings of non-Buddhist rivals uphold the sublime Dharma.

source: གང་དག་ཆོས་ཀྱི་ཕུང་པོ་བརྒྱད་ཁྲི་བཞི་སྟོང་འཛིན་ཀྱང་ཆོས་སུ་འདུ་ཤེས་པ་ཡང་མ་མཆིས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who uphold the eighty-four thousand Dharma teachings but do not perceive them as the Dharma uphold the sublime Dharma.

source: གང་དག་ཉོན་མོངས་པ་དང་། ཉེ་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་དང་། སྡིག་པ་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་དང་ལྷན་ཅིག་མི་གནས་ཀྱང་ཆོས་མ་ལགས་པའི་འདུ་ཤེས་ཀྱང་མ་མཆིས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who do not innately experience any of the afflictive emotions, secondary afflictive emotions, or evil and nonvirtuous qualities, and yet do not perceive them as non-Dharma, uphold the sublime Dharma.

source: གང་དག་སེམས་རྣམ་པར་གྲོལ་ཡང་བདག་གི་སེམས་ཅན་རྣམ་པར་གྲོལ་བའོ་སྙམ་དུ་རློམ་སེམས་མ་མཆིས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who lack the conceit of thinking, ‘My mind is liberated,’ even though their mind is liberated, uphold the sublime Dharma.

source: གང་དག་སངས་རྒྱས་ཐམས་ཅད་ལ་བསྙེན་བཀུར་བགྱིད་ཀྱང་ལུས་དང་། ངག་དང་། སེམས་ཀྱི་བརྟུལ་བ་ཡང་མ་ལགས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who render service to all buddhas but are not rigid in body, speech, or mind uphold the sublime Dharma.

source: གང་དག་ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་ཡང་ཆོས་དང་ཆོས་མ་ལགས་པའི་འདུ་ཤེས་ལ་མི་སྤྱོད་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །གང་དག་ཆོས་ཐམས་ཅད་གཟུང་བའི་སླད་དུའམ།
en: Those who have mastered all phenomena but do not get involved in perceptions of Dharma or non-Dharma uphold the sublime Dharma.

source: སྤང་བའི་སླད་དུ་ཡང་མ་ཞུགས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: “Those who do not act to either hold on to or abandon phenomena uphold the sublime Dharma.

source: གང་དག་ཐོབ་པར་བགྱི་བའི་སླད་དུའམ། མངོན་སུམ་དུ་བགྱི་བའི་སླད་དུ་ཡང་མ་ཞུགས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who do not act to either attain or actualize something uphold the sublime Dharma.

source: གང་དག་ཡོངས་སུ་འཛིན་པ་ཐམས་ཅད་ལ་སེམས་མི་འཛིན་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །གང་དག་སོ་སོའི་སྐྱེ་བོ་ཡང་མ་ལགས། སློབ་པ་ཡང་མ་ལགས།
en: Those who do not mentally fixate on any kind of upholding uphold the sublime Dharma.

source: དགྲ་བཅོམ་པ་ཡང་མ་ལགས། གང་ལ་ཡང་གནས་པ་མ་ལགས་ལ། འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ཀྱང་ཟད་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who are not ordinary people, in training, arhats, or who do not exist in any other state, but have exhausted their desire, anger, and dullness, uphold the sublime Dharma.

source: གང་དག་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་ཀྱང་སངས་རྒྱས་ཉིད་དུ་ཡང་མི་སྨོན་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who are prophesied to awaken, but do not aspire to buddhahood, uphold the sublime Dharma.

source: གང་དག་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་མཆི་ཡང་ཐམས་ཅད་དུ་ཡང་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་འདུ་ཤེས་པ་མ་མཆིས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who have reached the seat of awakening, but do not hold any kind of perception about the seat of awakening, uphold the sublime Dharma.

source: གང་དག་བདུད་ལས་རྣམ་པར་རྒྱལ་བར་བགྱིད་ཀྱང་བདུད་དང་བདུད་ཀྱི་རིས་རྣམས་ཀྱང་མི་དམིགས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who have achieved victory over Māra, but do not conceptually fixate on māras and their type, uphold the sublime Dharma.

source: གང་དག་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་ཡང་སྔ་ན་མ་མཆིས་པའི་ཆོས་ཀྱང་མི་འཐོབ་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who have reached perfect awakening but did not attain any previously unknown qualities uphold the sublime Dharma.

source: གང་དག་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར་ཡང་སེམས་ཅན་དང་ཆོས་གང་ཡང་འཇུག་པ་མ་མཆིས་ལྡོག་པ་ཡང་མ་མཆིས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who turn the wheel of Dharma, but do not engage with or reject beings or the Dharma, uphold the sublime Dharma.

source: གང་དག་མུ་སྟེགས་བྱེད་པ་ཐམས་ཅད་ཚར་གཅོད་ཀྱང་རྩོད་པ་ཡང་དེ་མ་མཆིས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who defeat people who take non-Buddhist positions, but do not engage in dispute, uphold the sublime Dharma.

source: གང་དག་སྐྱེ་བ་ཡང་གསར་པ་ཡང་མ་ལགས། རྙིང་པ་ཡང་མ་ལགས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who are born, but are neither young nor old, uphold the sublime Dharma.

source: གང་དག་འཆི་བ་ཡང་མ་མཆིས། ཟད་པ་ཡང་མ་མཆིས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who do not die or expire uphold the sublime Dharma.

source: གང་དག་ཁམས་གསུམ་པ་ལས་ཡང་དག་པར་འདའ་ཡང་གང་དུ་ཡང་མི་འཆི་བ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who pass away from the three realms, but do not go anywhere, uphold the sublime Dharma.

source: གང་དག་བརྗོད་པ་ཐམས་ཅད་རྗོད་ཀྱང་མངོན་པར་རྗོད་པ་ཡང་མ་མཆིས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Those who make all statements, but state nothing, uphold the sublime Dharma.

source: བཅོམ་ལྡན་འདས་གང་དག་ཆོས་ཐམས་ཅད་ལ་ཡང་མི་ཆགས་ལ་གང་དག་ཀྱང་སླར་མི་ཕྱོགས་པ་དེ་དག་དམ་པའི་ཆོས་ཡོངས་སུ་འཛིན་པ་ལགས་སོ། །
en: Blessed One, those who are not attached to anything, but do not turn away from anything, uphold the sublime Dharma.

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀུན་དགའ་བོ་ཁྱོད་ཀྱི་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་དང་འཐུན་ནོ། །
en: The Blessed One replied, “Ānanda, your Dharma discourse is in accord.”

source: ཀུན་དགའ་བོས་ཆོས་ཡང་དག་པར་བརྗོད་པ་འདི་བརྗོད་ན་ལྷའི་བུ་བརྒྱད་ཁྲི་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་སྐྱེས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་སུམ་ཁྲི་ཉིས་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་བོ། །དགེ་སློང་ལྔ་བརྒྱ་ནི་ལེན་པ་མེད་པར་ཟག་པ་ལས་སེམས་རྣམ་པར་གྲོལ་ལོ། །
en: After Ānanda spoke this discourse on the Dharma, eighty thousand gods generated the mind set on unsurpassable, completely perfect awakening, thirty-two thousand bodhisattvas attained acceptance of the nonarising of phenomena, and five hundred monks freed their minds from the defilements without further grasping.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ།
en: The bodhisattva great being Maitreya next addressed the Blessed One: “Blessed One, consider this example.

source: དཔེར་ན་ཕུབ་མ་བོར་ནས་འབྲས་ལེན་པ་དེ་བཞིན་དུ་ཆོས་མ་ལགས་པ་བོར་ནས་ཆོས་འཛིན་ཏོ། །
en: Taking the grain after discarding its husk is similar to taking up the Dharma after discarding what is not the Dharma.

source: དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེར་སྣ་བོར་ནས་སྦྱིན་པ་དང་། འཆལ་པའི་ཚུལ་ཁྲིམས་བོར་ནས་ཚུལ་ཁྲིམས་དང་། གནོད་སེམས་བོར་ནས་བཟོད་པ་དང་། ལེ་ལོ་བོར་ནས་བརྩོན་འགྲུས་དང་། རྣམ་པར་གཡེང་བ་བོར་ནས་བསམ་གཏན་དང་།
en: Thus, a bodhisattva takes up generosity after discarding stinginess, takes up discipline after discarding poor discipline, takes up patience after discarding maliciousness, takes up diligence after discarding laziness, takes up meditative stability after discarding distraction, and takes up insight after discarding faulty insight.

source: འཆལ་པའི་ཤེས་རབ་བོར་ནས་ཤེས་རབ་འཛིན་པ་འདི་ནི་ཆོས་ཡང་དག་པར་བརྗོད་པ་ལགས་སོ། །
en: This is a discourse on the Dharma.

source: བཅོམ་ལྡན་འདས་གཞན་ཡང་ཡིད་ཀྱིས་སྨོན་པ་ནི་ཆོས་མ་ལགས་སོ། །
en: “Furthermore, Blessed One, it is not the Dharma to mentally aspire.

source: གང་མི་སྨོན་པ་དེ་ནི་མི་འཛིན་ཏོ། །
en: One who does not aspire does not cling.

source: གང་མི་འཛིན་པ་དེ་མི་སྲུང་ངོ་། །
en: One who does not cling is not on guard.

source: གང་མི་སྲུང་བ་དེ་ཀུན་ནས་ཉོན་མི་མོངས་སོ། །
en: One who is not on guard is not defiled.
